<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"17414f1a00d0ef2b9b0cd55b7f4c626ebc2e879947dd105bfa368b876d71a6e4","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1130 at https://github.com/cal-itp/data-infra/actions/runs/19942837424","plan_out_hash":"5ee841f2bce37a5a410c9275fe55c1363211abcbd21a26e151bc536e182f5e6f","plan_hash":"49be77aca3755267d2751dbac9d5fd8ee4ebc364249812107cab99ed42a4c33d","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 3 to add, 12 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/download_parse_and_validate_gtfs.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "s7gutw==" -> (known after apply)
!~      detect_md5hash      = "dZZ/3dsMDhV45nOmOfaxRQ==" -> "different hash"
!~      generation          = 1764720235185955 -> (known after apply)
        id                  = "calitp-staging-composer-dags/download_parse_and_validate_gtfs.py"
!~      md5hash             = "dZZ/3dsMDhV45nOmOfaxRQ==" -> (known after apply)
        name                = "dags/download_parse_and_validate_gtfs.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar"] will be destroyed
  # (because key ["plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "application/zip" -> null
-       crc32c              = "1hT7ow==" -> null
-       detect_md5hash      = "omifem08VTXEfwdktvRcLQ==" -> null
-       event_based_hold    = false -> null
-       generation          = 1764720241445065 -> null
-       id                  = "calitp-staging-composer-plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar" -> null
-       md5hash             = "omifem08VTXEfwdktvRcLQ==" -> null
-       md5hexhash          = "a2689f7a6d3c5535c47f0764b6f45c2d" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/plugins%2Fgtfs_validator%2Fgtfs-validator-7.1.0-cli.jar?generation=1764720241445065&alt=media" -> null
-       metadata            = {} -> null
-       name                = "plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar" -> null
-       output_name         = "plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/plugins%2Fgtfs_validator%2Fgtfs-validator-7.1.0-cli.jar" -> null
-       source              = "../../../../airflow/plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/gtfs_validator_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "MJdUzA==" -> (known after apply)
!~      detect_md5hash      = "KQe6F2Pg00lgiDvRJczyIg==" -> "different hash"
!~      generation          = 1764720235183656 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/hooks/gtfs_validator_hook.py"
!~      md5hash             = "KQe6F2Pg00lgiDvRJczyIg==" -> (known after apply)
        name                = "plugins/hooks/gtfs_validator_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/bigquery_to_download_config_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "KvENpw==" -> (known after apply)
!~      detect_md5hash      = "T4VqE/DM0g8dGIROGUZ4Ww==" -> "different hash"
!~      generation          = 1764720235202890 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/bigquery_to_download_config_operator.py"
!~      md5hash             = "T4VqE/DM0g8dGIROGUZ4Ww==" -> (known after apply)
        name                = "plugins/operators/bigquery_to_download_config_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gtfs_csv_to_jsonl_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "q+Eqyg==" -> (known after apply)
!~      detect_md5hash      = "kuVQXWLAe56hVXCtUay2fw==" -> "different hash"
!~      generation          = 1764720235189696 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gtfs_csv_to_jsonl_operator.py"
!~      md5hash             = "kuVQXWLAe56hVXCtUay2fw==" -> (known after apply)
        name                = "plugins/operators/gtfs_csv_to_jsonl_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/unzip_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "cR3bKA==" -> (known after apply)
!~      detect_md5hash      = "dFpsoptt00kw9KcQmcFUZQ==" -> "different hash"
!~      generation          = 1764720235201641 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/unzip_gtfs_to_gcs_operator.py"
!~      md5hash             = "dFpsoptt00kw9KcQmcFUZQ==" -> (known after apply)
        name                = "plugins/operators/unzip_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/validate_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "fuB0Fg==" -> (known after apply)
!~      detect_md5hash      = "yKJ9z3QNM6BodQPUtMjbjw==" -> "different hash"
!~      generation          = 1764720235191074 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/validate_gtfs_to_gcs_operator.py"
!~      md5hash             = "yKJ9z3QNM6BodQPUtMjbjw==" -> (known after apply)
        name                = "plugins/operators/validate_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "EsypDQ==" -> (known after apply)
!~      detect_md5hash      = "RvOTRN37wdJwjRjyNVkfYw==" -> "different hash"
!~      generation          = 1764720236523983 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "RvOTRN37wdJwjRjyNVkfYw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/benefits/fct_benefits_events.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "AmoX1g==" -> (known after apply)
!~      detect_md5hash      = "32e2YxZ8YVVpaVcbMfrV+w==" -> "different hash"
!~      generation          = 1762380824121196 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/benefits/fct_benefits_events.sql"
!~      md5hash             = "32e2YxZ8YVVpaVcbMfrV+w==" -> (known after apply)
        name                = "data/warehouse/models/mart/benefits/fct_benefits_events.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_daily_feed_scheduled_service_summary.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "5sdfzw==" -> (known after apply)
!~      detect_md5hash      = "BqF0GHPLaCl3E8H7NDf3Cg==" -> "different hash"
!~      generation          = 1763689443092504 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/fct_daily_feed_scheduled_service_summary.sql"
!~      md5hash             = "BqF0GHPLaCl3E8H7NDf3Cg==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_daily_feed_scheduled_service_summary.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_daily_schedule_rt_operator_summary.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/mart/gtfs/fct_daily_schedule_rt_operator_summary.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/mart/gtfs/fct_daily_schedule_rt_operator_summary.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_daily_scheduled_stops.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "5OGvWQ==" -> (known after apply)
!~      detect_md5hash      = "TzqxS1XpaxZDpCw+42iMIQ==" -> "different hash"
!~      generation          = 1763689442727236 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/fct_daily_scheduled_stops.sql"
!~      md5hash             = "TzqxS1XpaxZDpCw+42iMIQ==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_daily_scheduled_stops.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_observed_trips.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "H1kFZQ==" -> (known after apply)
!~      detect_md5hash      = "Cv4/TlSpZhHhB6hO5attyA==" -> "different hash"
!~      generation          = 1754428271598925 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/fct_observed_trips.sql"
!~      md5hash             = "Cv4/TlSpZhHhB6hO5attyA==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_observed_trips.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs_rollup/fct_monthly_operator_summary.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/mart/gtfs_rollup/fct_monthly_operator_summary.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/mart/gtfs_rollup/fct_monthly_operator_summary.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs_rollup/fct_operator_hourly_summary.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/mart/gtfs_rollup/fct_operator_hourly_summary.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/mart/gtfs_rollup/fct_operator_hourly_summary.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "VyAxDg==" -> (known after apply)
!~      detect_md5hash      = "wymN8j1T3K10x0O7e+8Tvw==" -> "different hash"
!~      generation          = 1764720239300427 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "wymN8j1T3K10x0O7e+8Tvw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 3 to add, 12 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1130](https://github.com/cal-itp/data-infra/actions/runs/19942837424)